In [1]:
import numpy as np
import pandas as pd

In [58]:
df_b = pd.read_csv('business.csv')
df_b['class'] = pd.Categorical(np.repeat('B', df_b.shape[0]), categories=['B', 'E'])
df_b.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,class
0,11-02-2022,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612",B
1,11-02-2022,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612",B
2,11-02-2022,Air India,AI,531,20:00,Delhi,24h 45m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,20:45,Mumbai,"42,220",B
3,11-02-2022,Air India,AI,839,21:25,Delhi,26h 30m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,23:55,Mumbai,"44,450",B
4,11-02-2022,Air India,AI,544,17:15,Delhi,06h 40m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,23:55,Mumbai,"46,690",B

In [57]:
df_e = pd.read_csv('economy.csv')
df_e['class'] = pd.Categorical(np.repeat('E', df_e.shape[0]), categories=['B', 'E'])
df_e.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,class
0,11-02-2022,SpiceJet,SG,8709,18:55,Delhi,02h 10m,non-stop,21:05,Mumbai,"5,953",E
1,11-02-2022,SpiceJet,SG,8157,06:20,Delhi,02h 20m,non-stop,08:40,Mumbai,"5,953",E
2,11-02-2022,AirAsia,I5,764,04:25,Delhi,02h 10m,non-stop,06:35,Mumbai,"5,956",E
3,11-02-2022,Vistara,UK,995,10:20,Delhi,02h 15m,non-stop,12:35,Mumbai,"5,955",E
4,11-02-2022,Vistara,UK,963,08:50,Delhi,02h 20m,non-stop,11:10,Mumbai,"5,955",E

In [59]:
df = pd.concat([
    df_b,
    df_e
], ignore_index=True)

df.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,class
0,11-02-2022,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612",B
1,11-02-2022,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612",B
2,11-02-2022,Air India,AI,531,20:00,Delhi,24h 45m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,20:45,Mumbai,"42,220",B
3,11-02-2022,Air India,AI,839,21:25,Delhi,26h 30m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,23:55,Mumbai,"44,450",B
4,11-02-2022,Air India,AI,544,17:15,Delhi,06h 40m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,23:55,Mumbai,"46,690",B

In [60]:
df.shape

(300261, 12)

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300261 entries, 0 to 300260
Data columns (total 12 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   date        300261 non-null  object
 1   airline     300261 non-null  object
 2   ch_code     300261 non-null  object
 3   num_code    300261 non-null  int64
 4   dep_time    300261 non-null  object
 5   from        300261 non-null  object
 6   time_taken  300261 non-null  object
 7   stop        300261 non-null  object
 8   arr_time    300261 non-null  object
 9   to          300261 non-null  object
 10  price       300261 non-null  object
 11  class       300261 non-null  category
dtypes: category(1), int64(1), object(10)
memory usage: 25.5+ MB

In [62]:
df.isna().sum()

date          0
airline       0
ch_code       0
num_code      0
dep_time      0
from          0
time_taken    0
stop          0
arr_time      0
to            0
price         0
class         0
dtype: int64

In [63]:
df = df[~df.duplicated()]

In [64]:
df[~df['date'].str.strip().str.match(r'^\d{1,2}-\d{1,2}-\d{4}$')].size

0

In [66]:
df['date'] = pd.to_datetime(df['date'], format="%d-%m-%Y")

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 300259 entries, 0 to 300260
Data columns (total 12 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   date        300259 non-null  datetime64[ns]
 1   airline     300259 non-null  object
 2   ch_code     300259 non-null  object
 3   num_code    300259 non-null  int64
 4   dep_time    300259 non-null  object
 5   from        300259 non-null  object
 6   time_taken  300259 non-null  object
 7   stop        300259 non-null  object
 8   arr_time    300259 non-null  object
 9   to          300259 non-null  object
 10  price       300259 non-null  object
 11  class       300259 non-null  category
dtypes: category(1), datetime64[ns](1), int64(1), object(9)
memory usage: 27.8+ MB

In [68]:
df['dep_time'] = pd.to_datetime(df['dep_time'], format='%H:%M')

In [69]:
from datetime import datetime
from pandas.tseries.offsets import Micro

INTERVAL_NAMES = ('Late_Night', 'Early_Morning', 'Morning', 'Afternoon', 'Evening', 'Night')
start_of_day = pd.Timestamp(df['dep_time'].iloc[0]).floor('D')
INTERVALS = pd.interval_range(start=start_of_day - Micro(1), periods=6, freq='4H')

print(INTERVALS)

def classify(dt):
    # ts = pd.Timestamp(dt)
    # start_of_day = ts.floor('D')
    # intervals = pd.interval_range(start=start_of_day - Micro(1), periods=6, freq='4H')
    # return INTERVAL_NAMES[intervals.get_loc(dt)]
    return INTERVAL_NAMES[INTERVALS.get_loc(dt)]

# classify(datetime(2024, 10, 5, 0, 0, 0, 0))
classify(df['dep_time'].iloc[0])
    
# print(classify(datetime(2024, 10, 5, 0, 0)))

IntervalIndex([(1899-12-31 23:59:59.999999, 1900-01-01 03:59:59.999999], (1900-01-01 03:59:59.999999, 1900-01-01 07:59:59.999999], (1900-01-01 07:59:59.999999, 1900-01-01 11:59:59.999999], (1900-01-01 11:59:59.999999, 1900-01-01 15:59:59.999999], (1900-01-01 15:59:59.999999, 1900-01-01 19:59:59.999999], (1900-01-01 19:59:59.999999, 1900-01-01 23:59:59.999999]], dtype='interval[datetime64[ns], right]')

'Evening'

In [349]:
df['dep_time'].iloc[0: 2000].apply(classify)

0         Evening
1         Evening
2           Night
3           Night
4         Evening
          ...
1995      Morning
1996    Afternoon
1997        Night
1998      Evening
1999      Evening
Name: dep_time, Length: 2000, dtype: object

In [351]:
tdf = df[~df['time_taken'].str.strip().str.match(r'\d?\dh\s\d?\dm')].copy()
tdf = pd.concat([df.iloc[:2].copy(), tdf])

In [356]:
tdf['time_taken']

0           h 00m
1         02h 15m
189973     1.3h m
198163    1.02h m
204802    1.03h m
247494    1.01h m
Name: time_taken, dtype: object

In [361]:
tdf['time_taken'].str.extract(r'(\d\d?)?(\.\d\d?)?h?\s*(\d\d+)?m?', expand=True)

          0    1    2
0       NaN  NaN   00
1        02  NaN   15
189973    1   .3  NaN
198163    1  .02  NaN
204802    1  .03  NaN
247494    1  .01  NaN

In [354]:
tdf.loc[0, 'time_taken'] = 'h 00m'
tdf.loc[189973, 'time_taken'] = '1.3h m'

In [21]:
H = df['time_taken'].str.strip().str.extract(r'(\d\d?)?(?:(\.\d\d?)?)?h', expand=True)
h = H[0].astype(pd.Int16Dtype()).rename('h')
hap = H[1].astype(pd.Float32Dtype()).rename('%h')
m = df['time_taken'].str.strip().str.extract(r'(\d?\d)?m')[0].astype(pd.Float32Dtype()).rename('m')

In [22]:
r = pd.concat([tdf['time_taken'], h, hap, m], axis=1).fillna(0)
r['m'] = r['%h'] * 60 + r['m']
r = r.drop(columns=['%h'])
r

       time_taken   h     m
0           h 00m   2   0.0
1         02h 15m   2  15.0
189973     1.3h m   1   1.8
198163    1.02h m   1   1.2
204802    1.03h m   1   1.8
...           ...  ..   ...
300256          0  13  50.0
300257          0  13  50.0
300258          0  20  35.0
300259          0  23  20.0
300260          0  24  25.0

[300259 rows x 3 columns]

In [23]:
pd.Timedelta(hours=10) + pd.Timedelta(minutes=10.1)

Timedelta('0 days 10:10:06')

stops

In [269]:
s = '1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia IXU\n\t\t\t\t\t\t\t\t\t\t\t\t'

In [321]:
import re
[ t for t in re.split(r'\s', s) if t != '' ]

['1-stop', 'Via', 'IXU']

In [338]:
stops = df['stop'].str.extract(r'(non|\d+\+?)-?stop')[0]

In [341]:
stops.replace({'non': 0}).value_counts()

0
1     250927
0      36044
2+     13288
Name: count, dtype: int64

duration

In [348]:
df['time_taken'][~df['time_taken'].str.match(r'(\d\d?)h\s+(\d\d?)m')]

189973    1.03h m
198163    1.02h m
204802    1.03h m
247494    1.01h m
Name: time_taken, dtype: object

days left

price

In [376]:
df['price'] = df['price'].str.replace(',', '').astype(pd.Int32Dtype())

In [377]:
df['price']

0         25612
1         25612
2         42220
3         44450
4         46690
          ...
300256     7697
300257     7709
300258     8640
300259     8640
300260     8640
Name: price, Length: 300259, dtype: Int32